Revit 2027 API
Transform1D.OfVector Method
 Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OfVector(
	double vector
)
Public Function OfVector (
	vector As Double
) As Double
public:
double OfVector(
	double vector
)
member OfVector :
        vector : float -> float
Parameters
vector Double
 The vector to transform.
Return Value
Double
 The transformed vector.
Remarks
 Transformation of a vector is not affected by the translational part of the transformation.
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace